<a href="https://colab.research.google.com/github/dohyun-kim92/TIL/blob/master/%EA%B2%B0%EC%B8%A1%EA%B0%92_%EC%A0%84%EC%B2%98%EB%A6%AC_ing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import datetime

In [5]:
call = pd.read_json("call_rate.json")
print(call[:30]) #  첫 30으로 주말 날짜가 비었는지 + 열 확인가능 
                 # call은 빈거 없으므로 pass

         date  rate
0  2005-05-01  3.29
1  2005-05-02  3.29
2  2005-05-03  3.30
3  2005-05-04  3.21
4  2005-05-05  3.21
5  2005-05-06  3.27
6  2005-05-07  3.27
7  2005-05-08  3.27
8  2005-05-09  3.29
9  2005-05-10  3.30
10 2005-05-11  3.30
11 2005-05-12  3.30
12 2005-05-13  3.29
13 2005-05-14  3.29
14 2005-05-15  3.29
15 2005-05-16  3.29
16 2005-05-17  3.29
17 2005-05-18  3.29
18 2005-05-19  3.19
19 2005-05-20  3.23
20 2005-05-21  3.23
21 2005-05-22  3.23
22 2005-05-23  3.29
23 2005-05-24  3.29
24 2005-05-25  3.29
25 2005-05-26  3.29
26 2005-05-27  3.29
27 2005-05-28  3.29
28 2005-05-29  3.29
29 2005-05-30  3.29

In [8]:
cb = pd.read_json("cb_rate.json")
print(cb[:30])                  # 빈날짜 확인
print(cb)                       # 처음과 끝 확인
date_len = pd.period_range(cb["date"][0], cb["date"][3778]) # 기간 사이 몇일이 있는지 알려줌 
len(date_len) # ★★★★★ 5월 1일은 따로 추가해야함 
              # 확인결과 cb, treasury_10year, treasury_3year가 주말 제외됨

         date  rate
0  2005-05-02  4.19
1  2005-05-03  4.16
2  2005-05-04  4.17
3  2005-05-06  4.18
4  2005-05-09  4.19
5  2005-05-10  4.20
6  2005-05-11  4.20
7  2005-05-12  4.17
8  2005-05-13  4.13
9  2005-05-16  4.10
10 2005-05-17  4.10
11 2005-05-18  4.08
12 2005-05-19  4.07
13 2005-05-20  4.08
14 2005-05-23  4.10
15 2005-05-24  4.07
16 2005-05-25  4.05
17 2005-05-26  4.04
18 2005-05-27  4.11
19 2005-05-30  4.11
20 2005-05-31  4.08
21 2005-06-01  4.04
22 2005-06-02  4.02
23 2005-06-03  4.02
24 2005-06-07  4.06
25 2005-06-08  4.06
26 2005-06-09  4.06
27 2005-06-10  4.09
28 2005-06-13  4.20
29 2005-06-14  4.19
           date  rate
0    2005-05-02  4.19
1    2005-05-03  4.16
2    2005-05-04  4.17
3    2005-05-06  4.18
4    2005-05-09  4.19
...         ...   ...
3774 2020-07-17  2.21
3775 2020-07-20  2.20
3776 2020-07-21  2.21
3777 2020-07-22  2.20
3778 2020-07-23  2.19

[3779 rows x 2 columns]

5562

-

In [133]:
# cb["date"][1] + datetime.timedelta(days=1)


# for i in range(len(date_len)): # 20 => cb  testnum = 20 -> 날짜 길이 세는거 찾기 
#     if cb["date"][i] + datetime.timedelta(days=1) == cb["date"][i+1] :
#         pass
#     else :
#         cb["date"][i+1] = cb["date"][i] + datetime.timedelta(days=1)
#         cb["rate"][i+1] = cb["rate"][i] # 위치에 정확히 들어가는거 찾아보기
#         # i += 1
# cb.head(30)

#date 먼저 다만들고 나중에 바꾸는 거도 하나 생각해보기
 # fillna 와 merge

Timestamp('2005-05-04 00:00:00')

# 날짜먼저 생성 후 merge로 합친다음 null값 처리하기

In [10]:
# 날짜 생성 코드
df = pd.DataFrame(
    {
#    'date': pd.Series(pd.date_range('2005-05-01 00:00', periods=5563, freq='D')  위아래 같은 값나오는 코드
    'date': pd.Series(pd.date_range(start = '2005-05-01', end = '2020-07-23'))
    })             # 주의할 것은 series 뒤에 pd.period_range 써주면 데이터 타입이 period라 오류 날 수 있으므로 date_range 사용할것
df.dtypes
df

           date
0    2005-05-01
1    2005-05-02
2    2005-05-03
3    2005-05-04
4    2005-05-05
...         ...
5558 2020-07-19
5559 2020-07-20
5560 2020-07-21
5561 2020-07-22
5562 2020-07-23

[5563 rows x 1 columns]

In [14]:
cb
# merge 전 type 일치하는지 확인 
print(type(cb['date'][0]))
print(type(df['date'][0]))

print("-"*40)
print(cb.dtypes)
print("-"*40)
print(df.dtypes)

<class 'pandas._libs.tslibs.timestamps.Timestamp'>
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
----------------------------------------
date    datetime64[ns]
rate           float64
dtype: object
----------------------------------------
date    datetime64[ns]
dtype: object

In [15]:
new_df = df.merge(cb , on = 'date', how = 'left')   # df 자리에쓴게 기준점임.. 이걸기준으로 how 어떤조인할지  
# ※주의 new_df = cd.merge(df , on = 'date', how = 'right') 처럼 cd와 df 자리바꾸고 right로 바꾸면 안됨 !! merge 앞에 쓰는게 기준점임  
new_df[1:30]
new_df

           date  rate
0    2005-05-01   NaN
1    2005-05-02  4.19
2    2005-05-03  4.16
3    2005-05-04  4.17
4    2005-05-05   NaN
...         ...   ...
5558 2020-07-19   NaN
5559 2020-07-20  2.20
5560 2020-07-21  2.21
5561 2020-07-22  2.20
5562 2020-07-23  2.19

[5563 rows x 2 columns]

pandas._libs.tslibs.period.Period